{"ETag":"W/\"datetime'2025-02-20T09%3A09%3A53.2465361Z'\"","PartitionKey":"IntuneTemplate","RowKey":"3751d55a-c9bc-4584-9de4-db2fc63fd367","Timestamp":"2025-02-20T09:09:53.2465361+00:00","JSON":"{\"Displayname\":\"BDO / Bruno Bock - Baseline - Bitlocker - v01\",\"Description\":null,\"RAWJson\":\"{\\\"@odata.type\\\":\\\"#microsoft.graph.windows10EndpointProtectionConfiguration\\\",\\\"roleScopeTagIds\\\":[\\\"0\\\"],\\\"deviceManagementApplicabilityRuleOsEdition\\\":null,\\\"deviceManagementApplicabilityRuleOsVersion\\\":null,\\\"deviceManagementApplicabilityRuleDeviceMode\\\":null,\\\"description\\\":null,\\\"displayName\\\":\\\"BDO / Bruno Bock - Baseline - Bitlocker - v01\\\",\\\"version\\\":1,\\\"dmaGuardDeviceEnumerationPolicy\\\":\\\"deviceDefault\\\",\\\"userRightsAccessCredentialManagerAsTrustedCaller\\\":null,\\\"userRightsAllowAccessFromNetwork\\\":null,\\\"userRightsBlockAccessFromNetwork\\\":null,\\\"userRightsActAsPartOfTheOperatingSystem\\\":null,\\\"userRightsLocalLogOn\\\":null,\\\"userRightsDenyLocalLogOn\\\":null,\\\"userRightsBackupData\\\":null,\\\"userRightsChangeSystemTime\\\":null,\\\"userRightsCreateGlobalObjects\\\":null,\\\"userRightsCreatePageFile\\\":null,\\\"userRightsCreatePermanentSharedObjects\\\":null,\\\"userRightsCreateSymbolicLinks\\\":null,\\\"userRightsCreateToken\\\":null,\\\"userRightsDebugPrograms\\\":null,\\\"userRightsRemoteDesktopServicesLogOn\\\":null,\\\"userRightsDelegation\\\":null,\\\"userRightsGenerateSecurityAudits\\\":null,\\\"userRightsImpersonateClient\\\":null,\\\"userRightsIncreaseSchedulingPriority\\\":null,\\\"userRightsLoadUnloadDrivers\\\":null,\\\"userRightsLockMemory\\\":null,\\\"userRightsManageAuditingAndSecurityLogs\\\":null,\\\"userRightsManageVolumes\\\":null,\\\"userRightsModifyFirmwareEnvironment\\\":null,\\\"userRightsModifyObjectLabels\\\":null,\\\"userRightsProfileSingleProcess\\\":null,\\\"userRightsRemoteShutdown\\\":null,\\\"userRightsRestoreData\\\":null,\\\"userRightsTakeOwnership\\\":null,\\\"xboxServicesEnableXboxGameSaveTask\\\":false,\\\"xboxServicesAccessoryManagementServiceStartupMode\\\":\\\"manual\\\",\\\"xboxServicesLiveAuthManagerServiceStartupMode\\\":\\\"manual\\\",\\\"xboxServicesLiveGameSaveServiceStartupMode\\\":\\\"manual\\\",\\\"xboxServicesLiveNetworkingServiceStartupMode\\\":\\\"manual\\\",\\\"localSecurityOptionsBlockMicrosoftAccounts\\\":false,\\\"localSecurityOptionsBlockRemoteLogonWithBlankPassword\\\":false,\\\"localSecurityOptionsDisableAdministratorAccount\\\":false,\\\"localSecurityOptionsAdministratorAccountName\\\":null,\\\"localSecurityOptionsDisableGuestAccount\\\":false,\\\"localSecurityOptionsGuestAccountName\\\":null,\\\"localSecurityOptionsAllowUndockWithoutHavingToLogon\\\":false,\\\"localSecurityOptionsBlockUsersInstallingPrinterDrivers\\\":false,\\\"localSecurityOptionsBlockRemoteOpticalDriveAccess\\\":false,\\\"localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUser\\\":\\\"notConfigured\\\",\\\"localSecurityOptionsMachineInactivityLimit\\\":null,\\\"localSecurityOptionsMachineInactivityLimitInMinutes\\\":null,\\\"localSecurityOptionsDoNotRequireCtrlAltDel\\\":false,\\\"localSecurityOptionsHideLastSignedInUser\\\":false,\\\"localSecurityOptionsHideUsernameAtSignIn\\\":false,\\\"localSecurityOptionsLogOnMessageTitle\\\":null,\\\"localSecurityOptionsLogOnMessageText\\\":null,\\\"localSecurityOptionsAllowPKU2UAuthenticationRequests\\\":false,\\\"localSecurityOptionsAllowRemoteCallsToSecurityAccountsManagerHelperBool\\\":false,\\\"localSecurityOptionsAllowRemoteCallsToSecurityAccountsManager\\\":null,\\\"localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients\\\":\\\"none\\\",\\\"localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers\\\":\\\"none\\\",\\\"lanManagerAuthenticationLevel\\\":\\\"lmAndNltm\\\",\\\"lanManagerWorkstationDisableInsecureGuestLogons\\\":false,\\\"localSecurityOptionsClearVirtualMemoryPageFile\\\":false,\\\"localSecurityOptionsAllowSystemToBeShutDownWithoutHavingToLogOn\\\":false,\\\"localSecurityOptionsAllowUIAccessApplicationElevation\\\":false,\\\"localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations\\\":false,\\\"localSecurityOptionsOnlyElevateSignedExecutables\\\":false,\\\"localSecurityOptionsAdministratorElevationPromptBehavior\\\":\\\"notConfigured\\\",\\\"localSecurityOptionsStandardUserElevationPromptBehavior\\\":\\\"notConfigured\\\",\\\"localSecurityOptionsSwitchToSecureDesktopWhenPromptingForElevation\\\":false,\\\"localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation\\\":false,\\\"localSecurityOptionsAllowUIAccessApplicationsForSecureLocations\\\":false,\\\"localSecurityOptionsUseAdminApprovalMode\\\":false,\\\"localSecurityOptionsUseAdminApprovalModeForAdministrators\\\":false,\\\"localSecurityOptionsInformationShownOnLockScreen\\\":\\\"notConfigured\\\",\\\"localSecurityOptionsInformationDisplayedOnLockScreen\\\":\\\"notConfigured\\\",\\\"localSecurityOptionsDisableClientDigitallySignCommunicationsIfServerAgrees\\\":false,\\\"localSecurityOptionsClientDigitallySignCommunicationsAlways\\\":false,\\\"localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers\\\":false,\\\"localSecurityOptionsDisableServerDigitallySignCommunicationsAlways\\\":false,\\\"localSecurityOptionsDisableServerDigitallySignCommunicationsIfClientAgrees\\\":false,\\\"localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares\\\":false,\\\"localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts\\\":false,\\\"localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares\\\":false,\\\"localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange\\\":false,\\\"localSecurityOptionsSmartCardRemovalBehavior\\\":\\\"noAction\\\",\\\"defenderSecurityCenterDisableAppBrowserUI\\\":null,\\\"defenderSecurityCenterDisableFamilyUI\\\":null,\\\"defenderSecurityCenterDisableHealthUI\\\":null,\\\"defenderSecurityCenterDisableNetworkUI\\\":null,\\\"defenderSecurityCenterDisableVirusUI\\\":null,\\\"defenderSecurityCenterDisableAccountUI\\\":null,\\\"defenderSecurityCenterDisableClearTpmUI\\\":null,\\\"defenderSecurityCenterDisableHardwareUI\\\":null,\\\"defenderSecurityCenterDisableNotificationAreaUI\\\":null,\\\"defenderSecurityCenterDisableRansomwareUI\\\":null,\\\"defenderSecurityCenterDisableSecureBootUI\\\":null,\\\"defenderSecurityCenterDisableTroubleshootingUI\\\":null,\\\"defenderSecurityCenterDisableVulnerableTpmFirmwareUpdateUI\\\":null,\\\"defenderSecurityCenterOrganizationDisplayName\\\":null,\\\"defenderSecurityCenterHelpEmail\\\":null,\\\"defenderSecurityCenterHelpPhone\\\":null,\\\"defenderSecurityCenterHelpURL\\\":null,\\\"defenderSecurityCenterNotificationsFromApp\\\":\\\"notConfigured\\\",\\\"defenderSecurityCenterITContactDisplay\\\":\\\"notConfigured\\\",\\\"windowsDefenderTamperProtection\\\":\\\"notConfigured\\\",\\\"firewallBlockStatefulFTP\\\":null,\\\"firewallIdleTimeoutForSecurityAssociationInSeconds\\\":null,\\\"firewallPreSharedKeyEncodingMethod\\\":\\\"deviceDefault\\\",\\\"firewallIPSecExemptionsNone\\\":false,\\\"firewallIPSecExemptionsAllowNeighborDiscovery\\\":false,\\\"firewallIPSecExemptionsAllowICMP\\\":false,\\\"firewallIPSecExemptionsAllowRouterDiscovery\\\":false,\\\"firewallIPSecExemptionsAllowDHCP\\\":false,\\\"firewallCertificateRevocationListCheckMethod\\\":\\\"deviceDefault\\\",\\\"firewallMergeKeyingModuleSettings\\\":null,\\\"firewallPacketQueueingMethod\\\":\\\"deviceDefault\\\",\\\"firewallProfileDomain\\\":null,\\\"firewallProfilePublic\\\":null,\\\"firewallProfilePrivate\\\":null,\\\"defenderAdobeReaderLaunchChildProcess\\\":\\\"notConfigured\\\",\\\"defenderAttackSurfaceReductionExcludedPaths\\\":[],\\\"defenderOfficeAppsOtherProcessInjectionType\\\":\\\"userDefined\\\",\\\"defenderOfficeAppsOtherProcessInjection\\\":\\\"userDefined\\\",\\\"defenderOfficeCommunicationAppsLaunchChildProcess\\\":\\\"notConfigured\\\",\\\"defenderOfficeAppsExecutableContentCreationOrLaunchType\\\":\\\"userDefined\\\",\\\"defenderOfficeAppsExecutableContentCreationOrLaunch\\\":\\\"userDefined\\\",\\\"defenderOfficeAppsLaunchChildProcessType\\\":\\\"userDefined\\\",\\\"defenderOfficeAppsLaunchChildProcess\\\":\\\"userDefined\\\",\\\"defenderOfficeMacroCodeAllowWin32ImportsType\\\":\\\"userDefined\\\",\\\"defenderOfficeMacroCodeAllowWin32Imports\\\":\\\"userDefined\\\",\\\"defenderScriptObfuscatedMacroCodeType\\\":\\\"userDefined\\\",\\\"defenderScriptObfuscatedMacroCode\\\":\\\"userDefined\\\",\\\"defenderScriptDownloadedPayloadExecutionType\\\":\\\"userDefined\\\",\\\"defenderScriptDownloadedPayloadExecution\\\":\\\"userDefined\\\",\\\"defenderPreventCredentialStealingType\\\":\\\"notConfigured\\\",\\\"defenderProcessCreationType\\\":\\\"userDefined\\\",\\\"defenderProcessCreation\\\":\\\"userDefined\\\",\\\"defenderUntrustedUSBProcessType\\\":\\\"userDefined\\\",\\\"defenderUntrustedUSBProcess\\\":\\\"userDefined\\\",\\\"defenderUntrustedExecutableType\\\":\\\"userDefined\\\",\\\"defenderUntrustedExecutable\\\":\\\"userDefined\\\",\\\"defenderEmailContentExecutionType\\\":\\\"userDefined\\\",\\\"defenderEmailContentExecution\\\":\\\"userDefined\\\",\\\"defenderAdvancedRansomewareProtectionType\\\":\\\"notConfigured\\\",\\\"defenderGuardMyFoldersType\\\":\\\"userDefined\\\",\\\"defenderGuardedFoldersAllowedAppPaths\\\":[],\\\"defenderAdditionalGuardedFolders\\\":[],\\\"defenderNetworkProtectionType\\\":\\\"notConfigured\\\",\\\"defenderExploitProtectionXml\\\":null,\\\"defenderExploitProtectionXmlFileName\\\":null,\\\"defenderSecurityCenterBlockExploitProtectionOverride\\\":false,\\\"defenderBlockPersistenceThroughWmiType\\\":\\\"userDefined\\\",\\\"appLockerApplicationControl\\\":\\\"notConfigured\\\",\\\"deviceGuardLocalSystemAuthorityCredentialGuardSettings\\\":\\\"notConfigured\\\",\\\"deviceGuardEnableVirtualizationBasedSecurity\\\":false,\\\"deviceGuardEnableSecureBootWithDMA\\\":false,\\\"deviceGuardSecureBootWithDMA\\\":\\\"notConfigured\\\",\\\"deviceGuardLaunchSystemGuard\\\":\\\"notConfigured\\\",\\\"smartScreenEnableInShell\\\":false,\\\"smartScreenBlockOverrideForFiles\\\":false,\\\"applicationGuardEnabled\\\":false,\\\"applicationGuardEnabledOptions\\\":\\\"notConfigured\\\",\\\"applicationGuardBlockFileTransfer\\\":\\\"notConfigured\\\",\\\"applicationGuardBlockNonEnterpriseContent\\\":false,\\\"applicationGuardAllowPersistence\\\":false,\\\"applicationGuardForceAuditing\\\":false,\\\"applicationGuardBlockClipboardSharing\\\":\\\"notConfigured\\\",\\\"applicationGuardAllowPrintToPDF\\\":false,\\\"applicationGuardAllowPrintToXPS\\\":false,\\\"applicationGuardAllowPrintToLocalPrinters\\\":false,\\\"applicationGuardAllowPrintToNetworkPrinters\\\":false,\\\"applicationGuardAllowVirtualGPU\\\":false,\\\"applicationGuardAllowFileSaveOnHost\\\":false,\\\"applicationGuardAllowCameraMicrophoneRedirection\\\":null,\\\"applicationGuardCertificateThumbprints\\\":[],\\\"bitLockerAllowStandardUserEncryption\\\":false,\\\"bitLockerDisableWarningForOtherDiskEncryption\\\":true,\\\"bitLockerEnableStorageCardEncryptionOnMobile\\\":false,\\\"bitLockerEncryptDevice\\\":true,\\\"bitLockerRecoveryPasswordRotation\\\":\\\"enabledForAzureAd\\\",\\\"defenderDisableScanArchiveFiles\\\":null,\\\"defenderAllowScanArchiveFiles\\\":null,\\\"defenderDisableBehaviorMonitoring\\\":null,\\\"defenderAllowBehaviorMonitoring\\\":null,\\\"defenderDisableCloudProtection\\\":null,\\\"defenderAllowCloudProtection\\\":null,\\\"defenderEnableScanIncomingMail\\\":null,\\\"defenderEnableScanMappedNetworkDrivesDuringFullScan\\\":null,\\\"defenderDisableScanRemovableDrivesDuringFullScan\\\":null,\\\"defenderAllowScanRemovableDrivesDuringFullScan\\\":null,\\\"defenderDisableScanDownloads\\\":null,\\\"defenderAllowScanDownloads\\\":null,\\\"defenderDisableIntrusionPreventionSystem\\\":null,\\\"defenderAllowIntrusionPreventionSystem\\\":null,\\\"defenderDisableOnAccessProtection\\\":null,\\\"defenderAllowOnAccessProtection\\\":null,\\\"defenderDisableRealTimeMonitoring\\\":null,\\\"defenderAllowRealTimeMonitoring\\\":null,\\\"defenderDisableScanNetworkFiles\\\":null,\\\"defenderAllowScanNetworkFiles\\\":null,\\\"defenderDisableScanScriptsLoadedInInternetExplorer\\\":null,\\\"defenderAllowScanScriptsLoadedInInternetExplorer\\\":null,\\\"defenderBlockEndUserAccess\\\":null,\\\"defenderAllowEndUserAccess\\\":null,\\\"defenderScanMaxCpuPercentage\\\":null,\\\"defenderCheckForSignaturesBeforeRunningScan\\\":null,\\\"defenderCloudBlockLevel\\\":null,\\\"defenderCloudExtendedTimeoutInSeconds\\\":null,\\\"defenderDaysBeforeDeletingQuarantinedMalware\\\":null,\\\"defenderDisableCatchupFullScan\\\":null,\\\"defenderDisableCatchupQuickScan\\\":null,\\\"defenderEnableLowCpuPriority\\\":null,\\\"defenderFileExtensionsToExclude\\\":[],\\\"defenderFilesAndFoldersToExclude\\\":[],\\\"defenderProcessesToExclude\\\":[],\\\"defenderPotentiallyUnwantedAppAction\\\":null,\\\"defenderScanDirection\\\":null,\\\"defenderScanType\\\":null,\\\"defenderScheduledQuickScanTime\\\":null,\\\"defenderScheduledScanDay\\\":null,\\\"defenderScheduledScanTime\\\":null,\\\"defenderSignatureUpdateIntervalInHours\\\":null,\\\"defenderSubmitSamplesConsentType\\\":null,\\\"defenderDetectedMalwareActions\\\":null,\\\"firewallRules\\\":[],\\\"bitLockerSystemDrivePolicy\\\":{\\\"encryptionMethod\\\":\\\"xtsAes256\\\",\\\"startupAuthenticationRequired\\\":true,\\\"startupAuthenticationBlockWithoutTpmChip\\\":true,\\\"startupAuthenticationTpmUsage\\\":\\\"required\\\",\\\"startupAuthenticationTpmPinUsage\\\":\\\"required\\\",\\\"startupAuthenticationTpmKeyUsage\\\":\\\"blocked\\\",\\\"startupAuthenticationTpmPinAndKeyUsage\\\":\\\"blocked\\\",\\\"minimumPinLength\\\":8,\\\"prebootRecoveryEnableMessageAndUrl\\\":true,\\\"prebootRecoveryMessage\\\":\\\"Im Falle eines Problems bitte an die interne IT wenden. In case of a problem, please contact the internal IT department.\\\",\\\"prebootRecoveryUrl\\\":null,\\\"recoveryOptions\\\":{\\\"blockDataRecoveryAgent\\\":true,\\\"recoveryPasswordUsage\\\":\\\"blocked\\\",\\\"recoveryKeyUsage\\\":\\\"blocked\\\",\\\"hideRecoveryOptions\\\":true,\\\"enableRecoveryInformationSaveToStore\\\":true,\\\"recoveryInformationToStore\\\":\\\"passwordOnly\\\",\\\"enableBitLockerAfterRecoveryInformationToStore\\\":true}},\\\"bitLockerFixedDrivePolicy\\\":{\\\"encryptionMethod\\\":\\\"xtsAes256\\\",\\\"requireEncryptionForWriteAccess\\\":true,\\\"recoveryOptions\\\":{\\\"blockDataRecoveryAgent\\\":true,\\\"recoveryPasswordUsage\\\":\\\"blocked\\\",\\\"recoveryKeyUsage\\\":\\\"blocked\\\",\\\"hideRecoveryOptions\\\":true,\\\"enableRecoveryInformationSaveToStore\\\":true,\\\"recoveryInformationToStore\\\":\\\"passwordOnly\\\",\\\"enableBitLockerAfterRecoveryInformationToStore\\\":true}},\\\"bitLockerRemovableDrivePolicy\\\":{\\\"encryptionMethod\\\":\\\"xtsAes256\\\",\\\"requireEncryptionForWriteAccess\\\":true,\\\"blockCrossOrganizationWriteAccess\\\":true}}\",\"Type\":\"Device\",\"GUID\":\"3751d55a-c9bc-4584-9de4-db2fc63fd367\"}"}